#**Session 2.  In-class activities**

Please enter your name in a cell below

In [102]:
# First name Last name 
# Andres Ayala

### In-class activity 1
### Using the dc_shipments dataset, perform the following operations to explore and clean the data:
1. Identify the manufacturing plants where the shipments are coming from (unique values of column plants)
2. Identify the data types (dtypes) of each column in the dataset
3. Convert columns dc and sku data types to string (object). Verify this by calling dtypes again
4. Rename columns ordered and delivered by qty_ordered and qty_delivered respectively

### Please, use cells below to write and execute your code. Feel free to add additional cells.

In [38]:
# write your code for in-class activity 1 here 
import pandas as pd

In [39]:
dc_shipments = pd.read_excel('dc_shipments (1).xlsx')

dc_shipments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22084 entries, 0 to 22083
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       22084 non-null  datetime64[ns]
 1   plant      22084 non-null  object
 2   dc         22073 non-null  float64
 3   sku        22076 non-null  float64
 4   ordered    22058 non-null  float64
 5   delivered  22067 non-null  float64
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 1.0+ MB

In [40]:
# 1. Identify the manufacturing plants where the shipments are coming from (unique values of column plants)

dc_shipments['plant'].unique()

array(['West', 'South west', 'Midwest', 'Southeast', 'South east',
       'Mid-atlantic', 'New England', 'west'], dtype=object)

In [41]:
# 2. Identify the data types (dtypes) of each column in the dataset
dc_shipments.dtypes

date         datetime64[ns]
plant                object
dc                  float64
sku                 float64
ordered             float64
delivered           float64
dtype: object

In [62]:
dc_shipments[['dc','sku']].astype(float)

          dc     sku
0      400.0  1080.0
1      280.0  1003.0
2      300.0  1085.0
3      320.0  1013.0
4      270.0  1086.0
...      ...     ...
22079  300.0  1085.0
22080  200.0  1065.0
22081  520.0  1102.0
22082  330.0  1010.0
22083  270.0  1040.0

[22008 rows x 2 columns]

In [63]:
# 3. Convert columns dc and sku data types to string (object). Verify this by calling dtypes again

dc_shipments['dc'] = dc_shipments['dc'].astype('object')
dc_shipments['sku'] = dc_shipments['sku'].astype('object')

dc_shipments.dtypes

# faster way dc_shipments[['dc','sku']] = dc_shipments[['dc','sku']].astype('str')

C:\Users\artur\AppData\Local\Temp\ipykernel_22472\709954611.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dc_shipments['dc'] = dc_shipments['dc'].astype('object')
C:\Users\artur\AppData\Local\Temp\ipykernel_22472\709954611.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dc_shipments['sku'] = dc_shipments['sku'].astype('object')

date             datetime64[ns]
plant                    object
dc                       object
sku                      object
qty_ordered             float64
qty_delivered           float64
dtype: object

In [43]:
# 4. Rename columns ordered and delivered by qty_ordered and qty_delivered respectively

dc_shipments.rename(columns={'ordered':'qty_ordered','delivered':'qty_delivered'}, inplace = True)
dc_shipments

            date        plant     dc     sku  qty_ordered  qty_delivered
0     2016-10-02         West  400.0  1080.0         88.0           88.0
1     2016-11-07         West  280.0  1003.0         36.0           36.0
2     2016-07-02   South west  300.0  1085.0         48.0           48.0
3     2016-09-22      Midwest  320.0  1013.0          3.0            3.0
4     2016-09-07   South west  270.0  1086.0         10.0           10.0
...          ...          ...    ...     ...          ...            ...
22079 2016-12-15   South west  300.0  1085.0         24.0           24.0
22080 2017-03-06  New England  200.0  1065.0          1.0            1.0
22081 2017-05-06   South east  520.0  1102.0         50.0           50.0
22082 2017-04-08  New England  330.0  1010.0         11.0           11.0
22083 2017-04-23   South west  270.0  1040.0          5.0            5.0

[22084 rows x 6 columns]

### In-class activity 2
### Using the dc_shipments dataset, perform the following operations to clean the data:
1. The column plant has a spelling error (west & West, Southeast & South east). Replace west by West and Southeast by South east. Verify this by calling .unique() again
2. How many duplicates are there in the dataset? Show those duplicated rows.Remove the duplicates and verify this by recounting the number of duplicates
3. How many na values by column are there in the dataset? Remove the rows with na values and confirm this by recounting the number of na values



### Please, use cells below to write and execute your code. Feel free to add additional cells.

In [44]:
# write your code for in-class activity 2 here 

#1. The column plant has a spelling error (west & West, Southeast & South east). Replace west by West and Southeast by South east. Verify this by calling .unique() again

dc_shipments['plant'].replace(['west','Southeast'],['West','South east'], inplace=True)
dc_shipments['plant'].unique()

array(['West', 'South west', 'Midwest', 'South east', 'Mid-atlantic',
       'New England'], dtype=object)

In [45]:
#2. How many duplicates are there in the dataset? Show those duplicated rows. Remove the duplicates and verify this by recounting the number of duplicates

print("total duplicates:", dc_shipments.duplicated().sum())

dc_shipments[dc_shipments.duplicated()]

total duplicates: 14

            date        plant     dc     sku  qty_ordered  qty_delivered
2496  2017-01-26         West  360.0  1043.0         15.0           15.0
3153  2017-05-23      Midwest  410.0  1043.0          7.5            0.0
5553  2016-08-07  New England  200.0  1065.0          2.0            0.0
8014  2016-11-18   South west  300.0  1019.0          1.0            0.0
9622  2017-04-07   South east  220.0  1051.0          4.5            0.0
16623 2016-12-13   South east  390.0  1070.0          2.0            2.0
17000 2016-11-18  New England  200.0  1019.0          3.5            0.0
17313 2016-07-21         West  350.0  1095.0          1.5            0.0
17656 2016-08-10  New England  200.0  1065.0          1.5            0.0
18466 2016-08-11         West  360.0  1043.0         15.0           15.0
18691 2017-03-06      Midwest  170.0  1021.0         63.0           63.0
18717 2017-03-25  New England  330.0  1001.0         13.0            0.0
19060 2017-03-01         West  360.0  1073.0         30.0           30.0
20122 2017-02-15         West  280.0  1042.0          9.0            0.0

In [46]:
dc_shipments = dc_shipments.drop_duplicates()

In [47]:
print("total duplicates:", dc_shipments.duplicated().sum())

total duplicates: 0

In [48]:
# 3. How many na values by column are there in the dataset? Remove the rows with na values and confirm this by recounting the number of na values

dc_shipments.isna().sum()

date              0
plant             0
dc               11
sku               8
qty_ordered      26
qty_delivered    17
dtype: int64

In [49]:
dc_shipments.dropna(inplace=True)

C:\Users\artur\AppData\Local\Temp\ipykernel_22472\780797096.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dc_shipments.dropna(inplace=True)

In [50]:
dc_shipments.isna().sum()

date             0
plant            0
dc               0
sku              0
qty_ordered      0
qty_delivered    0
dtype: int64

### In-class activity 3
### Use the CO2_emissions_2017 dataset to identify the most polluting vehicle.In order to answer this question, write a Python program that perform the following operations:
1. Create a column with the average C02 emissions
2. Create a column with the standard deviation of CO2 emissions
3. Create a column calculating the standardized C02 emissions: (value-average)/standard deviation
4. Identify the vehicle (ID) with the largest standardized C02 emissions. What is the maximum value?




### Please, use cells below to write and execute your code. Feel free to add additional cells. 
### Submit the resulting .ipynb file with all three in-class activities to Canvas. Don’t forget to enter your name.

In [92]:
# write your code for in-class activity 3 here 


co2_2017 = pd.read_excel('CO2_emissions_2017.xlsx')

co2_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23236 entries, 0 to 23235
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Vehicle_ID     23236 non-null  int64
 1   Year           23236 non-null  int64
 2   Month          23236 non-null  int64
 3   Day            23236 non-null  int64
 4   Distance       23236 non-null  int64
 5   Weight         23236 non-null  int64
 6   CO2_emissions  23236 non-null  float64
dtypes: float64(1), int64(6)
memory usage: 1.2 MB

In [93]:
# 1. Create a column with the average C02 emissions
co2_2017['Avg_CO2']=co2_2017['CO2_emissions'].mean()
co2_2017

       Vehicle_ID  Year  Month  Day  Distance  Weight  CO2_emissions   Avg_CO2
0            1363  2017      1    1        58       6         0.0754  0.062982
1             798  2017      1    2        58       6         0.0754  0.062982
2             799  2017      1    2        78       7         0.0858  0.062982
3             869  2017      1    2        59       5         0.0885  0.062982
4             873  2017      1    2        45       8         0.0405  0.062982
...           ...   ...    ...  ...       ...     ...            ...       ...
23231       14711  2017      3   31        58       8         0.0522  0.062982
23232       14750  2017      3   31        68       6         0.0884  0.062982
23233       14772  2017      3   31        62       5         0.0930  0.062982
23234       14778  2017      3   31        73      10         0.0511  0.062982
23235       14779  2017      3   31        66       5         0.0990  0.062982

[23236 rows x 8 columns]

In [103]:
# 2. Create a column with the standard deviation of CO2 emissions

co2_2017['Std_CO2']=co2_2017['CO2_emissions'].std()
co2_2017

,Vehicle_ID,Year,Month,Day,Distance,Weight,CO2_emissions,Avg_CO2,Std_CO2,Standarized_CO2
0,1363,2017,1,1,58,6,0.0754,0.062982,0.020086,0.618275
1,798,2017,1,2,58,6,0.0754,0.062982,0.020086,0.618275
2,799,2017,1,2,78,7,0.0858,0.062982,0.020086,1.136059
3,869,2017,1,2,59,5,0.0885,0.062982,0.020086,1.270484
4,873,2017,1,2,45,8,0.0405,0.062982,0.020086,-1.119289
...,...,...,...,...,...,...,...,...,...,...
23231,14711,2017,3,31,58,8,0.0522,0.062982,0.020086,-0.536782
23232,14750,2017,3,31,68,6,0.0884,0.062982,0.020086,1.265505
23233,14772,2017,3,31,62,5,0.0930,0.062982,0.020086,1.494525
23234,14778,2017,3,31,73,10,0.0511,0.062982,0.020086,-0.591548
23235,14779,2017,3,31,66,5,0.0990,0.062982,0.020086,1.793247

In [105]:
# 3. Create a column calculating the standardized C02 emissions: (value-average)/standard deviation
co2_2017['Standarized_CO2']=(co2_2017['CO2_emissions']-co2_2017['Avg_CO2'])/co2_2017['Std_CO2']
co2_2017

,Vehicle_ID,Year,Month,Day,Distance,Weight,CO2_emissions,Avg_CO2,Std_CO2,Standarized_CO2
0,1363,2017,1,1,58,6,0.0754,0.062982,0.020086,0.618275
1,798,2017,1,2,58,6,0.0754,0.062982,0.020086,0.618275
2,799,2017,1,2,78,7,0.0858,0.062982,0.020086,1.136059
3,869,2017,1,2,59,5,0.0885,0.062982,0.020086,1.270484
4,873,2017,1,2,45,8,0.0405,0.062982,0.020086,-1.119289
...,...,...,...,...,...,...,...,...,...,...
23231,14711,2017,3,31,58,8,0.0522,0.062982,0.020086,-0.536782
23232,14750,2017,3,31,68,6,0.0884,0.062982,0.020086,1.265505
23233,14772,2017,3,31,62,5,0.0930,0.062982,0.020086,1.494525
23234,14778,2017,3,31,73,10,0.0511,0.062982,0.020086,-0.591548
23235,14779,2017,3,31,66,5,0.0990,0.062982,0.020086,1.793247

In [106]:
# 4. Identify the vehicle (ID) with the largest standardized C02 emissions. What is the maximum value?
co2_2017['Standarized_CO2'].max()

4.033659188999146

In [107]:
co2_2017[co2_2017['Standarized_CO2']==co2_2017['Standarized_CO2'].max()]

,Vehicle_ID,Year,Month,Day,Distance,Weight,CO2_emissions,Avg_CO2,Std_CO2,Standarized_CO2
22642,14649,2017,3,29,96,5,0.144,0.062982,0.020086,4.033659

In [108]:
co2_2017.loc[co2_2017['Standarized_CO2'].idxmax()]

Vehicle_ID         14649.000000
Year                2017.000000
Month                  3.000000
Day                   29.000000
Distance              96.000000
Weight                 5.000000
CO2_emissions          0.144000
Avg_CO2                0.062982
Std_CO2                0.020086
Standarized_CO2        4.033659
Name: 22642, dtype: float64

In [110]:
co2_2017.sort_values(by=['Standarized_CO2'],ascending = False)

,Vehicle_ID,Year,Month,Day,Distance,Weight,CO2_emissions,Avg_CO2,Std_CO2,Standarized_CO2
22642,14649,2017,3,29,96,5,0.1440,0.062982,0.020086,4.033659
14183,14368,2017,2,23,92,5,0.1380,0.062982,0.020086,3.734938
18312,14361,2017,3,11,91,5,0.1365,0.062982,0.020086,3.660257
4071,1215,2017,1,17,89,5,0.1335,0.062982,0.020086,3.510896
10904,14645,2017,2,10,89,5,0.1335,0.062982,0.020086,3.510896
...,...,...,...,...,...,...,...,...,...,...
23010,1327,2017,3,31,29,10,0.0203,0.062982,0.020086,-2.124986
17175,14620,2017,3,7,29,10,0.0203,0.062982,0.020086,-2.124986
14915,1469,2017,2,27,28,10,0.0196,0.062982,0.020086,-2.159836
16923,1054,2017,3,7,24,9,0.0192,0.062982,0.020086,-2.179751
16127,1531,2017,3,3,26,10,0.0182,0.062982,0.020086,-2.229538